#ifndef __PARAMETER_H
#define __PARAMETER_H
/*=============================================数学参数=============================================*/
#define PI 3.141592653589793238462643383279f
/*=============================================结构参数=============================================*/

/*=============================================麦轮参数=============================================*/
#define Mecanum_WheelRadius									7.0f//麦轮半径(单位cm)
#define Mecanum_rx											    24.00f//底盘中心到轮子中心的距离的x轴分量(单位cm)
#define Mecanum_ry											    24.00f//底盘中心到轮子中心的距离的y轴分量(单位cm)
/*=============================================电机参数=============================================*/
#define M3508_MotorReductionRatio					  19.0f//麦轮电机减速比
#define M3508_Encoder           						8191.0f//麦轮电机编码器
#define M6020_MotorReductionRatio					  36.0f//云台电机减速比
#define M6020_Encoder           						8191.0f//云台电机编码器


#endif
